[
  {
    "date": "2022-10-03T00:00:00",
    "isDefault": false,
    "rooms": [
      {
        "id": 25859,
        "name": "Lloyds Banking Group Room",
        "sessions": [
          {
            "id": "df288396-df54-4e8e-832b-6011bd8bc1ae",
            "title": "Coffee",
            "description": null,
            "startsAt": "2022-10-03T08:00:00",
            "endsAt": "2022-10-03T09:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "58cd6e14-12fc-46e4-8cea-cd2295476e0f",
            "title": "Opening",
            "description": null,
            "startsAt": "2022-10-03T09:00:00",
            "endsAt": "2022-10-03T09:10:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "378009",
            "title": "eBPF or sidecars?",
            "description": "eBPF allows us to build custom programs that run directly within the kernel. This talk explores how eBPF enables observability, security and connectivity tools that no longer need to rely on the sidecar model, and shows how Cilium now supports both sidecar-based and sidecarless Service Mesh. Along the way this talk will clarify some container and kernel concepts so that attendees can leave with a mental model for the pros and cons of sidecar-based or sidecarless approaches. \r\n",
            "startsAt": "2022-10-03T09:10:00",
            "endsAt": "2022-10-03T09:40:00",
            "isServiceSession": false,
            "isPlenumSession": true,
            "speakers": [
              {
                "id": "e48a182b-1cac-4e51-93b5-5e82408a6116",
                "name": "Liz Rice"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "355030",
            "title": "Applying GitOps To Everything",
            "description": "You are likely already using GitOps for your applications, but not for everything else. You are likely not using Argo CD, Flux, Rancher Fleet, or similar tools to manage the state of your infrastructure and services. Why is that? If GitOps is a great solution for apps, isn't it safe to assume that it would be equally beneficial for anything else? What is missing?\r\n\r\nThe problem is that most of the commonly used GitOps tools are managing Kubernetes resources which, traditionally, do not deal with infrastructure and Cloud services. That's what we need to change. We need to expand Kubernetes with custom resources that can manage anything, no matter whether that's AWS, Azure, Google Cloud, GitHub, Elastic, DataDog, or any other Cloud service. If we do that, we might convert Kubernetes API into a universal API. We might convert the Kubernetes control plane into a universal control plane. If we do that, we will get end-to-end GitOps through which everything is always in sync and where all we have to do is push changes to Git repositories.\r\n\r\nAll we need to make that happen is Crossplane (an open-source project donated to CNCF), combined with Argo CD, Flux, or Rancher Fleet. Let's see it in action.",
            "startsAt": "2022-10-03T09:45:00",
            "endsAt": "2022-10-03T10:25:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "97fd9697-d280-4391-8e99-0e4698bc76db",
                "name": "Viktor Farcic"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "359754",
            "title": "Clear Your Own Path to Open Source Maintainer",
            "description": "How many times have you heard the phrase \"chop wood and carry water\"? What about \"look at the good first issues\" or \"triage the issues queue\"?  Or even \"go out there and make yourself known to the community\"? Open Source project members throw around these phrases as if they are the panacea to becoming a contributor, then a committer, and finally a maintainer. However, it is not that easy. \r\nThese phrases can only help if you know what they mean! Demystifying this path to leadership in Open Source is imperative to the industry because we can’t grow on a path to continuous learning if we aren’t welcoming the next generation of contributors to our projects with clear and inclusive language.  \r\n \r\nSo here are some better questions to ask yourself when approaching a new Open Source project:  \r\nWhat can I do if the first issues queue doesn’t contain any issues to work on?  \r\nHow do I introduce myself to the community?  \r\nWhat if I can't find anything on the issue queue that makes sense? \r\nWhat contributions are needed most by this community?  \r\nHow do I climb the community role ladder toward leadership?  \r\n \r\nPeople need guidance and support when climbing the mountain from the valley of becoming a new contributor to the zenith of maintainership. It is not always just as simple as following the community contributor guidelines. In this presentation I cover tips and trick on how to conquer that journey. Through practical examples of how I became a Helm maintainer, I hope that more people will realize it is within their grasp to become maintainers in Open Source projects. And the reality is that these projects NEED you too.",
            "startsAt": "2022-10-03T10:30:00",
            "endsAt": "2022-10-03T11:15:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "2b2add40-e4d0-4686-b135-a90532540cb7",
                "name": "Martin Hickey"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "5282b2c9-e2d9-495b-b52f-7cd20887380a",
            "title": "Break",
            "description": null,
            "startsAt": "2022-10-03T11:15:00",
            "endsAt": "2022-10-03T11:30:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "343039",
            "title": "Integrating Backup Into Your GitOps CI/CD Pipeline",
            "description": "The ability to deploy code and version code has been a de facto requirement and a reason we have CI/CD pipelines for our application development, but with Kubernetes in particular we are seeing a closer tie between code and data. In particular, code being deployed can affect and change your data, for that reason, we need to consider protecting that data as part of our Continuous Development pipelines, In this session, we will focus on how we can incorporate backup actions into your pipeline to ensure that any code changes will start by creating a restore point be it a snapshot or an export to another external repository. We will then as part of a demo incorporate a failure scenario into the environment pipeline to simulate how a configmap can manipulate data to cause data loss. Then we need a way to bring the data back!",
            "startsAt": "2022-10-03T11:30:00",
            "endsAt": "2022-10-03T12:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "4392fedb-5d24-4c36-9db8-6f37d78e033a",
                "name": "Michael Cade"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "343521",
            "title": "Securing Kubernetes with Open Policy Agent",
            "description": "Kubernetes RBAC goes as far as whether a user can or cannot create new Kubernetes resources. However, it does not provide any capabilities for having more granular control on what resources can be created and what properties they might have. Validation webhooks fix that problem. They allow the user to define custom logic that looks at the resource being created/edited and, based on their properties, to allow or deny the operation.\r\n\r\nGatekeeper is an implementation of a validation webhook that uses Open Policy Agent and allows you to define policies via the Rego language. These policies are applied to the Kube API server and live in Kubernetes as first-class citizens.\r\n\r\nThis presentation will describe what validating webhooks are, how they work and how OPA and Gatekeeper leverage this functionality to protect your Kubernetes cluster. We will also dive into Rego and write our custom OPA policies.",
            "startsAt": "2022-10-03T12:15:00",
            "endsAt": "2022-10-03T12:55:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "2c654d6b-a5fb-46f2-800a-022d222e87d0",
                "name": "Anton Sankov"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121140,
                    "name": "Presentation (20m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "56e7e3a4-6a37-4194-92e5-c3e679946073",
            "title": "Lunch",
            "description": null,
            "startsAt": "2022-10-03T13:00:00",
            "endsAt": "2022-10-03T14:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "358854",
            "title": "Hacking Kubernetes Like a Beginner with kdigger",
            "description": "During this session, Mahé will demonstrate a simple scenario of a multi-tenant attack in a Kubernetes cluster. He will explain the risks, see how to prevent this kind of attack and show how kdigger can speed up the discovery process of the environment.\r\n\r\nkdigger, short for \"Kubernetes digger\", is a context discovery and container assessment tool for Kubernetes penetration testing. This tool is a compilation of various plugins to facilitate pentesting Kubernetes from inside a pod.\r\n\r\nOn top of discovering a new tool, this presentation will give you an idea of how pentesters generally try to pivot in typical Kubernetes clusters.",
            "startsAt": "2022-10-03T14:00:00",
            "endsAt": "2022-10-03T14:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "e0bdd89a-ee3d-4083-b933-2e1db6f4ce94",
                "name": "Mahé Tardy"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121140,
                    "name": "Presentation (20m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "359381",
            "title": "Stick a fork in it, it’s done: how to halt your sidecar jobs",
            "description": "Inspired by some of the research done by the Linkerd team and by suggestions from the Linkerd community, Linkerd maintainer Matei David will present a few ways of ensuring that when deploying jobs,  sidecar containers terminate successfully when the main container finishes. \r\n\r\nSince the early days of Kubernetes, the sidecar container design pattern represents an easy and intuitive way to enhance the main container in a pod. The pattern has seen increased usage and adoption in production environments and serves a variety of platform-agnostic use cases such as collecting metrics and proxying traffic. Sidecar containers work well with most Kubernetes primitives, such as deployments, but they fall short when used in job objects. For service meshes or metric collectors, sidecars need to run continuously, blocking jobs from completing even after the main container has finished its work. \r\n",
            "startsAt": "2022-10-03T14:20:00",
            "endsAt": "2022-10-03T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "90531675-78bd-4c6d-af22-8c2bb0f4bb09",
                "name": "Matei David"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121140,
                    "name": "Presentation (20m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "355107",
            "title": "Network Engineering Goes DevOoopsie",
            "description": "I sit here and reflect back to 2008 when my supervisor suggested I look into the CCNA and Network+. My world changed from plugging a cable into a switch to setting up BGP peers, to configuring Load Balancers for High Availability. Network Engineering has evolved and from my eyes, has been entirely reimagined, retaining the foundations of networking. \r\n\r\nAs I've slowly pivoted to the world of Cloud Native technologies and DevOps, a lot of my previous Network Engineering skills have translated to today's approach to microservices architecture. FOLLOW THE PACKETS I SAY!\r\n\r\nWhat does Networking mean for consumers of Kubernetes and Containers? What does K8S and containers mean Network Engineers? What does that transformation for a Network Engineer look like? \r\n\r\nIn this restrospective talk, I share my journey of Network Engineering from the late 2000s to one in 2022 surrounded by the world distributed systems, observability, the deeper need for security/identity and what our traffic tells us. \r\n\r\nMy hope is to inspire others to transform their network engineering career.",
            "startsAt": "2022-10-03T14:45:00",
            "endsAt": "2022-10-03T15:25:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "d7100338-7ea1-4f10-84fe-758b7ecbe1e7",
                "name": "Marino Wijay"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "342887",
            "title": "Deploying a simple (Python) app to Kubernetes/OpenShift",
            "description": "JJ will walk you through deploying a simple python application to Kubernetes/OpenShift. We’ll start from the ground up, then get a complete automated build. The goal is to enable your developers to focus on code, not the infrastructure! It’s a chance to see the power of OpenShift and why taking the time to learn cloud-native development can get you the velocity you need.",
            "startsAt": "2022-10-03T15:30:00",
            "endsAt": "2022-10-03T16:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "1de5e334-6895-4c02-8b48-75ee6c1b46ca",
                "name": "JJ Asghar"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "e4fcaf33-14a9-493a-bbb2-ec0713d2bee7",
            "title": "Break",
            "description": null,
            "startsAt": "2022-10-03T16:10:00",
            "endsAt": "2022-10-03T16:30:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "352614",
            "title": "Secret Management: The Soft Way",
            "description": "Secrets. Security best-practices mandate that they stay away from the code—or else! And that’s what we did for a long time.\r\nBut as CI/CD practices evolved, for a myriad of reasons, we now want to ship the code, the environment, and the secrets, all in one lump. So, we can’t hide the secrets anymore… unless?\r\n\r\nTools like HashiCorp Vault attempt to address this by managing secrets outside the delivery chain. Great! But you can’t use those inside local dev environments, so… When that’s precisely what you need to do, then what?\r\n\r\nIn this talk, Lian will show the audience how to manage secrets the GitOps way, so you can maintain security best-practices while also being able to use them in your local environment for development. Sound like magic? That’s because it is.\r\n\r\nAfter this talk, the audience will be able to understand secret management solutions that work seamlessly in a variety of environments.",
            "startsAt": "2022-10-03T16:30:00",
            "endsAt": "2022-10-03T17:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "1559cccc-ed7c-4296-973d-3b05f3c3d25e",
                "name": "Lian Li"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "349810",
            "title": "Kubernetes cost monitoring best practices",
            "description": "There have been scenarios in which companies struggle to understand where they spend their cloud budget. For example, distinguishing between projects, teams, and applications with infrastructure services utilising them. Starting with why cost monitoring is essential, in this session, we'll learn about some of the best practices for monitoring your Kubernetes costs to maximise efficiency and reduce spending across teams, followed by some of the approaches we have seen organisations follow. Cost allocation can be complex in Kubernetes; hence, we'll also discuss what cost allocation models should be used. Such a set of best practices can reduce cloud spend and increase awareness within one's organisation.",
            "startsAt": "2022-10-03T17:15:00",
            "endsAt": "2022-10-03T17:35:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "8b4fad4b-e6a6-4574-adfa-5a0666393e9a",
                "name": "Kunal Kushwaha"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121140,
                    "name": "Presentation (20m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "d29b6d98-b25c-408a-8fce-790bf90b152a",
            "title": "Closing",
            "description": null,
            "startsAt": "2022-10-03T17:40:00",
            "endsAt": "2022-10-03T18:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 25860,
        "name": "ControlPlane Room",
        "sessions": [
          {
            "id": "359969",
            "title": "Hacking Kubernetes: Live Demo Marathon",
            "description": "In a live evocation of the recent O’Reilly title Hacking Kubernetes (Martin, Hausenblas, 2021), this ultimate guide to threat-driven Kubernetes defence threat models and details how to attack and defend your precious clusters from nefarious adversaries. \r\n\r\nThis broad and detailed appraisal of end-to-end cluster security teaches you how to attack and defend against a range of historical and current CVEs, misconfigurations, and advanced threats:\r\n\r\n- See the historical relevance of CVEs and demonstrations of attacks against your containers, pods, supply chain, network, storage, policy, and wider organisation\r\n- Understand when to use next-generation runtimes like gVisor, firecracker, and Kata Containers\r\n- Delve into workload identity and advanced runtime hardening\r\n- Consider the trust boundaries in soft- and hard-multitenant systems to appraise and limit the effects of compromise\r\n- Learn to navigate the choppy waters of advanced Kubernetes security \r\n",
            "startsAt": "2022-10-03T09:45:00",
            "endsAt": "2022-10-03T10:25:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "30968699-c1ac-4eb9-8866-71cefe09a983",
                "name": "Andrew Martin"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120911,
                    "name": "Advanced"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "360104",
            "title": "The Dark Side of GitOps: Unanswered Real-life Challenges",
            "description": "You’ve probably heard all the benefits of GitOps practices, but even most trivial challenges are going unanswered in vendor demos and keynotes. Things like how I promote between environments, how can I handle infrastructure, what if I already got infrastructure that is managed by others like networking…\r\nDeploying to Kubernetes with GitOps is quite mature, though you’ll need additional services like databases, clusters. You’ll find that if you’d use Cluster API, Crossplane, AWS Controllers for Kubernetes it might solve your issue until it doesn’t integrate as you’d imagine.\r\nDuring this presentation I’ll go through some of the challenges we faced during rewriting LastPass’ full deployment model, solving end-to-end automation for real-life while writing less YAML files by moving towards Infrastructure as Software.",
            "startsAt": "2022-10-03T10:30:00",
            "endsAt": "2022-10-03T10:50:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "ecc60188-8a62-49f1-832a-f981c34ba991",
                "name": "Ádám Szücs-Mátyás"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121140,
                    "name": "Presentation (20m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120911,
                    "name": "Advanced"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "343449",
            "title": "You've been holding it wrong",
            "description": "CI/CD is what gets your code from your laptop to your Kubernetes. If that is not the case, this talk is not for you.\r\n\r\nWhat if I told you that you've been holding CI/CD wrong all this time? If you can't run it locally, need to wait more than 5 minutes to see if a change works, and get goose bumps when someone on your team mentions migrating CI/CD, you're holding it wrong. \r\n\r\nAfter decades thinking about this problem, this is what holding it right means to me. Kubernetes is a small piece of the puzzle, and contrary to what many think, it should not be used to solve all problems. I learned this from someone else, and also...\r\n\r\nJoin me if you are curious to see where this goes.",
            "startsAt": "2022-10-03T10:50:00",
            "endsAt": "2022-10-03T11:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "cd78eda7-1dc4-4d9c-900c-8f590b811b81",
                "name": "Gerhard Lazu"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121140,
                    "name": "Presentation (20m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120911,
                    "name": "Advanced"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "359981",
            "title": "Who Can You Really Trust?",
            "description": "Intangible “trust” is required to secure our systems: we need it to bootstrap infrastructure, secure the software supply chain, run workloads, and reassure our customers of their privacy. But how do we establish and secure this \"trust\" in a dynamic cloud-native system?\r\n\r\nThe advent of hardware-based attestation and certificate authentication gives us new hope. But this brave new dawn has been just over the horizon for the last few years, and new technologies have emerged to champion the identification of our workloads.\r\n\r\nIn this talk we:\r\n* Demystify the nebulous concept of Workload Identity\r\n* Define the importance of autonomous identity generation in a Zero Trust Architecture\r\n* Demonstrate practical examples of bootstrapping and using Workload Identity\r\n* Introduce existing and emerging technologies that enable you to anchor Workload Identity to a Hardware Root of Trust\r\n",
            "startsAt": "2022-10-03T11:30:00",
            "endsAt": "2022-10-03T12:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "f805f38c-c9f6-4496-9e5d-f424be611da3",
                "name": "Ric Featherstone"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "358931",
            "title": "Step by step Kubernetes observability with eBPF",
            "description": "In this talk, I'm exploring how someone can use eBPF to get insights about the communications happening in a Kubernetes cluster.\r\nI write an eBPF program and then use the BumbleBee (https://github.com/solo-io/bumblebee) open source project to build and deploy it.\r\nThis program gathers information about all the network communications happening in the cluster and publish the corresponding metrics that I store on Prometheus.\r\nI then deploy a service gets the metrics and correlate them with the Pod and Service IP addresses to build a graph displaying all the communications.",
            "startsAt": "2022-10-03T12:15:00",
            "endsAt": "2022-10-03T12:55:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "8a229569-5156-4e17-a427-a180d065e79f",
                "name": "Denis Jannot"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "357410",
            "title": "Migrating a cluster with 2000+ microservices to managed Kubernetes: lessons and learnings",
            "description": "Monzo has been running a single self-hosted Kubernetes cluster per-environment for years, and we decided to migrate to a managed Kubernetes service. This talk is all about the challenges and perils of doing a high stakes, real world, zero downtime Kubernetes migration at scale 🤓 We’ll talk about the constraints and challenges, including:\r\n\r\n- the complexity, diversity and quantity of the systems running on the cluster\r\n- downtime having real human impact with someone potentially not being able to pay for food or make a rent payment\r\n- the sheer number of different services and teams to interact with which meant that we had to adopt an automated process that was fully transparent to other engineers\r\n\r\nWe’ll dive into some of the technical details that allowed us to migrate within these constraints, and our plans for rearchitecting our platform to make future upgrades and migrations easier.\r\n\r\nTakeaways will include:\r\n\r\n- How Kubernetes makes infrastructure migrations more manageable\r\n- Actionable learnings about doing migrations at scale in general",
            "startsAt": "2022-10-03T14:00:00",
            "endsAt": "2022-10-03T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "5019a8c2-7d5a-455f-bb92-a961426ceb5d",
                "name": "Miles Bryant"
              },
              {
                "id": "57870761-7278-4d97-9395-1f1a87ccc39d",
                "name": "Suhail Patel"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120911,
                    "name": "Advanced"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "345842",
            "title": "How to protect your Kubernetes cluster using Crowdsec",
            "description": "The [CrowdSec](https://github.com/crowdsecurity/crowdsec/) project aims at providing a crowdsourced approach to common infrastructure defense problems, by distributing free & open-source software allowing you to protect yourself and share information about malevolent actors.\r\n\r\nCrowdSec could be perceived as a modern form of Fail2ban, though for Cloud and container-based infrastructure as well and capable of taking way more advanced decisions a lot faster. Mainly, it’s using a decoupled and distributed approach (detect here, remedy there) and an inference engine that leverages leaky buckets, YAML & Grok patterns to identify aggressive behaviors. It acquires signals from various data sources like files, syslogd, journald, AWS Cloudwatch and Kinesis, Docker logs and Windows Event Log, normalizes them, enriches them to apply heuristics and triggers a bouncer to deal with the threat, if need be. Since it’s written in Go, it’s compatible with almost any environment, fast in execution and ressource conservative.\r\n\r\nThe endgame is the Reputation engine though. If you want to partake in the network to benefit from its findings, CrowdSec captures all aggression signals (timestamp, IP, behavior) and sends them for curation. That way, it establishes a reliable IP blacklist that is constantly redistributed to the network members, in order to achieve a form of Digital Herd Immunity. An IP caught aggressing WordPress sites will quickly be banned by all members using CrowdSec that subscribed to the WordPress defense collection. In that way, we share the IPs that are relevant to your technical context.\r\n\r\nWhile Crowdsec is in charge of the detection, the reaction is performed by \"bouncers\" that aim to be deployable at any level of the applicative / infrastructure stack : \r\n\r\n* via nftables/iptables/pf based on an IP set\r\n* via Nginx lua plugin\r\n* via Traefik middleware\r\n* on Cloudflare via our bouncer that integrates with Cloudflare API\r\n* Or GCP/AWS/Azure firewall, slack or scripting, notifications, etc.\r\n\r\n.. or in many other ways. Over time the possibilities will increase as the application design basically supports anything. \r\n\r\nThis approach, combined with a declarative configuration and a stateless behavior, will make it an ideal candidate to enhance the security of modern stacks (containers, kubernetes, serverless and more generally automatically deployed infrastructures).\r\n\r\nFurthermore, we intend to create and share the most accurate database of malevolent actors as possible, under the form of a real-time IP reputation system, accessible through API. Whenever an attack is locally blocked/detected by Crowdsec, the \"meta\" information of the attack is shared amongst participants (source ip, date and triggered scenario) for redistribution to network members.\r\n\r\nWe are committed to building a strong community, with all that it implies :\r\n* [a public hub](https://hub.crowdsec.net) to find, share and amend parsers, scenarios and blockers\r\n* permissive open-source license to stay business friendly\r\n* and overall a strong commitment to transparency and community-first mentality, by tooling and behavior\r\n\r\nThe microservice architecture is the most significant security challenge in a Kubernetes cluster. Every application you deploy opens a new potential entry for attackers, increasing the attack surface.\r\nIn this talk, we'll present the Crowdsec project and see how we can protect a kubernetes cluster using Crowdsec and the power of the Crowd.\r\n",
            "startsAt": "2022-10-03T14:45:00",
            "endsAt": "2022-10-03T15:25:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "0cbcbc69-645a-44e6-b8ba-c81d3a0f4a59",
                "name": "Hamza Essahely"
              },
              {
                "id": "bbff0ea2-cc32-4655-9be8-2936a4a805ce",
                "name": "Sebastien Blot"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "360162",
            "title": "Policy + Cloud Controllers = Secure Scalable Dev-Centric Infrastructure.",
            "description": "In large organizations, securing cloud infrastructure around Kubernetes is hard. Application developers, who’ve already had to learn Kubernetes, shouldn’t need to become IAC SMEs to operate their applications' backend cloud infrastructure. Alternatively, using infrastructure teams to service requests and centralize control doesn’t scale with an increasing number of users and use cases.\r\n\r\nIn this talk, Rowan and Henry will demonstrate how infrastructure teams can use policy engines to secure an emerging model that uses Kubernetes hosted cloud controllers (Crossplane, ACK, config-connector) to provision infrastructure. This model enables application teams to self serve, whilst preventing the launch of insecure infrastructure.\r\n\r\nTo ease adoption of the model, Rowan and Henry will open source policies and templates to enforce controls aligned with the CIS benchmarks and to simplify the developer experience by setting secure defaults and dynamically generating supporting cloud resources.",
            "startsAt": "2022-10-03T15:30:00",
            "endsAt": "2022-10-03T16:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "8ff09cbf-da9f-48bc-a236-4bec7d006b36",
                "name": "Rowan Baker"
              },
              {
                "id": "8ca8e2c4-b696-43eb-bce9-423c06472c07",
                "name": "Henry Mortimer"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "390164",
            "title": "The Future of Continuous Delivery",
            "description": "It’s the year 2022, an exciting time for the tech industry. Globally, software organizations and internet companies are delivering more and more software, at a rate and scale that we’ve never faced before.\r\n\r\nThis unprecedented demand has created new challenges for us all, which have been hurting our organizations when creating continuous delivery solutions.\r\n\r\nThe great thing about these new challenges is that they’ve sparked new and amazing innovations in the CI/CD industry. In this Paul Dragoonis talks about the following:\r\n\r\nNew innovations in the CI/CD, Cloud Native, and open source communities are being developed.\r\n\r\nWhere these innovations are taking the world of continuous delivery.\r\n\r\nWhat to expect, from the CD community, later this year, and into the future",
            "startsAt": "2022-10-03T16:30:00",
            "endsAt": "2022-10-03T17:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "f10fddcf-5028-4f78-b861-13b2c44fef8e",
                "name": "Paul Dragoonis"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "344082",
            "title": "Building Operators for Legacy Software or: Running Minecraft on Kubernetes",
            "description": "I've always loved Minecraft, and I've always loved playing it with my friends. Being the one with a home server, I setup my own Minecraft server. Soon I wanted to manage it with Kubernetes like the rest of my applications, and wanted to automate common tasks like backups and upgrades.\r\n\r\nSo I made an operator. This talk will cover the how of making an operator for a 'legacy' application that is not designed to be cloud-native, and why you might want to do it.\r\n\r\nThe operator is open source at https://github.com/jameslaverack/minecraft-operator. The operator and the talk are not endorsed by Mojang Studios or Microsoft in any way.",
            "startsAt": "2022-10-03T17:15:00",
            "endsAt": "2022-10-03T17:35:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "dc6b649b-15d2-4ede-a156-b1250ab5dd8c",
                "name": "James Laverack"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121140,
                    "name": "Presentation (20m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120911,
                    "name": "Advanced"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 27478,
        "name": "Workshops Room",
        "sessions": [
          {
            "id": "359715",
            "title": "Building event-driven, serverless functions in Kubernetes",
            "description": "In modern organizations, event-driven architecture combined with FaaS has become more popular because they address some of the challenges of building distributed systems. As these organisations grow, they switch to Kubernetes to scale and manage more services. With the switch to Kubernetes, you want to provide a seamless experience for building and deploying services on Kubernetes.\r\n\r\nThat begs the question, how do I build event-driven serverless applications in Kubernetes?\r\n\r\nThis workshop will teach you how to build such applications with Kubernetes. You're going to develop an e-commerce serverless API. By the end of this course, you will have learned how to work with Knative and Cloud Events, manage the functions using a monorepo, and implement a continuous deployment pipeline.",
            "startsAt": "2022-10-03T09:45:00",
            "endsAt": "2022-10-03T12:55:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "5e1c2ff4-bb76-4d1b-a6f3-ba9b764af4b4",
                "name": "Peter Mbanugo"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 120908,
                    "name": "Tutorial / Workshop"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 27478,
            "room": "Workshops Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "356678",
            "title": "Get to know Envoy - the modern proxy for cloud-native infrastructure",
            "description": "Envoy Proxy is a foundational layer for many of the innovations propelling the Kubernetes community, including service meshes and cloud-native API gateways. But many engineers understand it only as a black box, hidden by simplifying levels of abstraction. The purpose of this workshop is to provide a hands-on workshop that will bridge those gaps in Envoy's understanding. Participants will explore first principles regarding Envoy architecture, filter chains, and a day-in-the-life of a request.",
            "startsAt": "2022-10-03T14:00:00",
            "endsAt": "2022-10-03T15:30:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "3b0cdb4d-7f3b-458f-be81-5e916b4756e2",
                "name": "Baptiste Collard"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 120908,
                    "name": "Tutorial / Workshop"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 27478,
            "room": "Workshops Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "358932",
            "title": "eBPF workshop",
            "description": "eBPF is a revolutionary technology with origins in the Linux kernel that can run sandboxed programs in an operating system kernel.\r\nIt is used to safely and efficiently extend the capabilities of the kernel without requiring to change kernel source code or load kernel modules.\r\nBumbleBee (https://github.com/solo-io/bumblebee) is a new Open Source project which helps to build, run and distribute eBPF programs using OCI images.\r\nIt allows you to focus on writing eBPF code, while taking care of the user space components - automatically exposing your data as metrics or logs.\r\nIn this workshop, we're introducing eBPF and the different ways to create eBPF programs.\r\nThen, attendees are creating their first eBPF program using BCC and libbpf to have a better understanding of the main concepts.\r\nFinally, they are going through several labs to build and deploy an eBPF program with BumbleBee. They also deploy Prometheus and a web application on Kubernetes to display all the communications happening in the  Kubernetes cluster.",
            "startsAt": "2022-10-03T15:30:00",
            "endsAt": "2022-10-03T17:35:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "8a229569-5156-4e17-a427-a180d065e79f",
                "name": "Denis Jannot"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 120908,
                    "name": "Tutorial / Workshop"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 27478,
            "room": "Workshops Room",
            "liveUrl": null,
            "recordingUrl": null
          }
        ],
        "hasOnlyPlenumSessions": false
      }
    ],
    "timeSlots": [
      {
        "slotStart": "08:00:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "df288396-df54-4e8e-832b-6011bd8bc1ae",
              "title": "Coffee",
              "description": null,
              "startsAt": "2022-10-03T08:00:00",
              "endsAt": "2022-10-03T09:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "09:00:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "58cd6e14-12fc-46e4-8cea-cd2295476e0f",
              "title": "Opening",
              "description": null,
              "startsAt": "2022-10-03T09:00:00",
              "endsAt": "2022-10-03T09:10:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "09:10:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "378009",
              "title": "eBPF or sidecars?",
              "description": "eBPF allows us to build custom programs that run directly within the kernel. This talk explores how eBPF enables observability, security and connectivity tools that no longer need to rely on the sidecar model, and shows how Cilium now supports both sidecar-based and sidecarless Service Mesh. Along the way this talk will clarify some container and kernel concepts so that attendees can leave with a mental model for the pros and cons of sidecar-based or sidecarless approaches. \r\n",
              "startsAt": "2022-10-03T09:10:00",
              "endsAt": "2022-10-03T09:40:00",
              "isServiceSession": false,
              "isPlenumSession": true,
              "speakers": [
                {
                  "id": "e48a182b-1cac-4e51-93b5-5e82408a6116",
                  "name": "Liz Rice"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "09:45:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "355030",
              "title": "Applying GitOps To Everything",
              "description": "You are likely already using GitOps for your applications, but not for everything else. You are likely not using Argo CD, Flux, Rancher Fleet, or similar tools to manage the state of your infrastructure and services. Why is that? If GitOps is a great solution for apps, isn't it safe to assume that it would be equally beneficial for anything else? What is missing?\r\n\r\nThe problem is that most of the commonly used GitOps tools are managing Kubernetes resources which, traditionally, do not deal with infrastructure and Cloud services. That's what we need to change. We need to expand Kubernetes with custom resources that can manage anything, no matter whether that's AWS, Azure, Google Cloud, GitHub, Elastic, DataDog, or any other Cloud service. If we do that, we might convert Kubernetes API into a universal API. We might convert the Kubernetes control plane into a universal control plane. If we do that, we will get end-to-end GitOps through which everything is always in sync and where all we have to do is push changes to Git repositories.\r\n\r\nAll we need to make that happen is Crossplane (an open-source project donated to CNCF), combined with Argo CD, Flux, or Rancher Fleet. Let's see it in action.",
              "startsAt": "2022-10-03T09:45:00",
              "endsAt": "2022-10-03T10:25:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "97fd9697-d280-4391-8e99-0e4698bc76db",
                  "name": "Viktor Farcic"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "359969",
              "title": "Hacking Kubernetes: Live Demo Marathon",
              "description": "In a live evocation of the recent O’Reilly title Hacking Kubernetes (Martin, Hausenblas, 2021), this ultimate guide to threat-driven Kubernetes defence threat models and details how to attack and defend your precious clusters from nefarious adversaries. \r\n\r\nThis broad and detailed appraisal of end-to-end cluster security teaches you how to attack and defend against a range of historical and current CVEs, misconfigurations, and advanced threats:\r\n\r\n- See the historical relevance of CVEs and demonstrations of attacks against your containers, pods, supply chain, network, storage, policy, and wider organisation\r\n- Understand when to use next-generation runtimes like gVisor, firecracker, and Kata Containers\r\n- Delve into workload identity and advanced runtime hardening\r\n- Consider the trust boundaries in soft- and hard-multitenant systems to appraise and limit the effects of compromise\r\n- Learn to navigate the choppy waters of advanced Kubernetes security \r\n",
              "startsAt": "2022-10-03T09:45:00",
              "endsAt": "2022-10-03T10:25:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "30968699-c1ac-4eb9-8866-71cefe09a983",
                  "name": "Andrew Martin"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120911,
                      "name": "Advanced"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          },
          {
            "id": 27478,
            "name": "Workshops Room",
            "session": {
              "id": "359715",
              "title": "Building event-driven, serverless functions in Kubernetes",
              "description": "In modern organizations, event-driven architecture combined with FaaS has become more popular because they address some of the challenges of building distributed systems. As these organisations grow, they switch to Kubernetes to scale and manage more services. With the switch to Kubernetes, you want to provide a seamless experience for building and deploying services on Kubernetes.\r\n\r\nThat begs the question, how do I build event-driven serverless applications in Kubernetes?\r\n\r\nThis workshop will teach you how to build such applications with Kubernetes. You're going to develop an e-commerce serverless API. By the end of this course, you will have learned how to work with Knative and Cloud Events, manage the functions using a monorepo, and implement a continuous deployment pipeline.",
              "startsAt": "2022-10-03T09:45:00",
              "endsAt": "2022-10-03T12:55:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "5e1c2ff4-bb76-4d1b-a6f3-ba9b764af4b4",
                  "name": "Peter Mbanugo"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 120908,
                      "name": "Tutorial / Workshop"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 27478,
              "room": "Workshops Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 2
          }
        ]
      },
      {
        "slotStart": "10:30:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "359754",
              "title": "Clear Your Own Path to Open Source Maintainer",
              "description": "How many times have you heard the phrase \"chop wood and carry water\"? What about \"look at the good first issues\" or \"triage the issues queue\"?  Or even \"go out there and make yourself known to the community\"? Open Source project members throw around these phrases as if they are the panacea to becoming a contributor, then a committer, and finally a maintainer. However, it is not that easy. \r\nThese phrases can only help if you know what they mean! Demystifying this path to leadership in Open Source is imperative to the industry because we can’t grow on a path to continuous learning if we aren’t welcoming the next generation of contributors to our projects with clear and inclusive language.  \r\n \r\nSo here are some better questions to ask yourself when approaching a new Open Source project:  \r\nWhat can I do if the first issues queue doesn’t contain any issues to work on?  \r\nHow do I introduce myself to the community?  \r\nWhat if I can't find anything on the issue queue that makes sense? \r\nWhat contributions are needed most by this community?  \r\nHow do I climb the community role ladder toward leadership?  \r\n \r\nPeople need guidance and support when climbing the mountain from the valley of becoming a new contributor to the zenith of maintainership. It is not always just as simple as following the community contributor guidelines. In this presentation I cover tips and trick on how to conquer that journey. Through practical examples of how I became a Helm maintainer, I hope that more people will realize it is within their grasp to become maintainers in Open Source projects. And the reality is that these projects NEED you too.",
              "startsAt": "2022-10-03T10:30:00",
              "endsAt": "2022-10-03T11:15:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "2b2add40-e4d0-4686-b135-a90532540cb7",
                  "name": "Martin Hickey"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "360104",
              "title": "The Dark Side of GitOps: Unanswered Real-life Challenges",
              "description": "You’ve probably heard all the benefits of GitOps practices, but even most trivial challenges are going unanswered in vendor demos and keynotes. Things like how I promote between environments, how can I handle infrastructure, what if I already got infrastructure that is managed by others like networking…\r\nDeploying to Kubernetes with GitOps is quite mature, though you’ll need additional services like databases, clusters. You’ll find that if you’d use Cluster API, Crossplane, AWS Controllers for Kubernetes it might solve your issue until it doesn’t integrate as you’d imagine.\r\nDuring this presentation I’ll go through some of the challenges we faced during rewriting LastPass’ full deployment model, solving end-to-end automation for real-life while writing less YAML files by moving towards Infrastructure as Software.",
              "startsAt": "2022-10-03T10:30:00",
              "endsAt": "2022-10-03T10:50:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "ecc60188-8a62-49f1-832a-f981c34ba991",
                  "name": "Ádám Szücs-Mátyás"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121140,
                      "name": "Presentation (20m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120911,
                      "name": "Advanced"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "10:50:00",
        "rooms": [
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "343449",
              "title": "You've been holding it wrong",
              "description": "CI/CD is what gets your code from your laptop to your Kubernetes. If that is not the case, this talk is not for you.\r\n\r\nWhat if I told you that you've been holding CI/CD wrong all this time? If you can't run it locally, need to wait more than 5 minutes to see if a change works, and get goose bumps when someone on your team mentions migrating CI/CD, you're holding it wrong. \r\n\r\nAfter decades thinking about this problem, this is what holding it right means to me. Kubernetes is a small piece of the puzzle, and contrary to what many think, it should not be used to solve all problems. I learned this from someone else, and also...\r\n\r\nJoin me if you are curious to see where this goes.",
              "startsAt": "2022-10-03T10:50:00",
              "endsAt": "2022-10-03T11:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "cd78eda7-1dc4-4d9c-900c-8f590b811b81",
                  "name": "Gerhard Lazu"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121140,
                      "name": "Presentation (20m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120911,
                      "name": "Advanced"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "11:15:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "5282b2c9-e2d9-495b-b52f-7cd20887380a",
              "title": "Break",
              "description": null,
              "startsAt": "2022-10-03T11:15:00",
              "endsAt": "2022-10-03T11:30:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "11:30:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "343039",
              "title": "Integrating Backup Into Your GitOps CI/CD Pipeline",
              "description": "The ability to deploy code and version code has been a de facto requirement and a reason we have CI/CD pipelines for our application development, but with Kubernetes in particular we are seeing a closer tie between code and data. In particular, code being deployed can affect and change your data, for that reason, we need to consider protecting that data as part of our Continuous Development pipelines, In this session, we will focus on how we can incorporate backup actions into your pipeline to ensure that any code changes will start by creating a restore point be it a snapshot or an export to another external repository. We will then as part of a demo incorporate a failure scenario into the environment pipeline to simulate how a configmap can manipulate data to cause data loss. Then we need a way to bring the data back!",
              "startsAt": "2022-10-03T11:30:00",
              "endsAt": "2022-10-03T12:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "4392fedb-5d24-4c36-9db8-6f37d78e033a",
                  "name": "Michael Cade"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "359981",
              "title": "Who Can You Really Trust?",
              "description": "Intangible “trust” is required to secure our systems: we need it to bootstrap infrastructure, secure the software supply chain, run workloads, and reassure our customers of their privacy. But how do we establish and secure this \"trust\" in a dynamic cloud-native system?\r\n\r\nThe advent of hardware-based attestation and certificate authentication gives us new hope. But this brave new dawn has been just over the horizon for the last few years, and new technologies have emerged to champion the identification of our workloads.\r\n\r\nIn this talk we:\r\n* Demystify the nebulous concept of Workload Identity\r\n* Define the importance of autonomous identity generation in a Zero Trust Architecture\r\n* Demonstrate practical examples of bootstrapping and using Workload Identity\r\n* Introduce existing and emerging technologies that enable you to anchor Workload Identity to a Hardware Root of Trust\r\n",
              "startsAt": "2022-10-03T11:30:00",
              "endsAt": "2022-10-03T12:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "f805f38c-c9f6-4496-9e5d-f424be611da3",
                  "name": "Ric Featherstone"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "12:15:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "343521",
              "title": "Securing Kubernetes with Open Policy Agent",
              "description": "Kubernetes RBAC goes as far as whether a user can or cannot create new Kubernetes resources. However, it does not provide any capabilities for having more granular control on what resources can be created and what properties they might have. Validation webhooks fix that problem. They allow the user to define custom logic that looks at the resource being created/edited and, based on their properties, to allow or deny the operation.\r\n\r\nGatekeeper is an implementation of a validation webhook that uses Open Policy Agent and allows you to define policies via the Rego language. These policies are applied to the Kube API server and live in Kubernetes as first-class citizens.\r\n\r\nThis presentation will describe what validating webhooks are, how they work and how OPA and Gatekeeper leverage this functionality to protect your Kubernetes cluster. We will also dive into Rego and write our custom OPA policies.",
              "startsAt": "2022-10-03T12:15:00",
              "endsAt": "2022-10-03T12:55:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "2c654d6b-a5fb-46f2-800a-022d222e87d0",
                  "name": "Anton Sankov"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121140,
                      "name": "Presentation (20m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "358931",
              "title": "Step by step Kubernetes observability with eBPF",
              "description": "In this talk, I'm exploring how someone can use eBPF to get insights about the communications happening in a Kubernetes cluster.\r\nI write an eBPF program and then use the BumbleBee (https://github.com/solo-io/bumblebee) open source project to build and deploy it.\r\nThis program gathers information about all the network communications happening in the cluster and publish the corresponding metrics that I store on Prometheus.\r\nI then deploy a service gets the metrics and correlate them with the Pod and Service IP addresses to build a graph displaying all the communications.",
              "startsAt": "2022-10-03T12:15:00",
              "endsAt": "2022-10-03T12:55:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "8a229569-5156-4e17-a427-a180d065e79f",
                  "name": "Denis Jannot"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "13:00:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "56e7e3a4-6a37-4194-92e5-c3e679946073",
              "title": "Lunch",
              "description": null,
              "startsAt": "2022-10-03T13:00:00",
              "endsAt": "2022-10-03T14:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "14:00:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "358854",
              "title": "Hacking Kubernetes Like a Beginner with kdigger",
              "description": "During this session, Mahé will demonstrate a simple scenario of a multi-tenant attack in a Kubernetes cluster. He will explain the risks, see how to prevent this kind of attack and show how kdigger can speed up the discovery process of the environment.\r\n\r\nkdigger, short for \"Kubernetes digger\", is a context discovery and container assessment tool for Kubernetes penetration testing. This tool is a compilation of various plugins to facilitate pentesting Kubernetes from inside a pod.\r\n\r\nOn top of discovering a new tool, this presentation will give you an idea of how pentesters generally try to pivot in typical Kubernetes clusters.",
              "startsAt": "2022-10-03T14:00:00",
              "endsAt": "2022-10-03T14:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "e0bdd89a-ee3d-4083-b933-2e1db6f4ce94",
                  "name": "Mahé Tardy"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121140,
                      "name": "Presentation (20m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "357410",
              "title": "Migrating a cluster with 2000+ microservices to managed Kubernetes: lessons and learnings",
              "description": "Monzo has been running a single self-hosted Kubernetes cluster per-environment for years, and we decided to migrate to a managed Kubernetes service. This talk is all about the challenges and perils of doing a high stakes, real world, zero downtime Kubernetes migration at scale 🤓 We’ll talk about the constraints and challenges, including:\r\n\r\n- the complexity, diversity and quantity of the systems running on the cluster\r\n- downtime having real human impact with someone potentially not being able to pay for food or make a rent payment\r\n- the sheer number of different services and teams to interact with which meant that we had to adopt an automated process that was fully transparent to other engineers\r\n\r\nWe’ll dive into some of the technical details that allowed us to migrate within these constraints, and our plans for rearchitecting our platform to make future upgrades and migrations easier.\r\n\r\nTakeaways will include:\r\n\r\n- How Kubernetes makes infrastructure migrations more manageable\r\n- Actionable learnings about doing migrations at scale in general",
              "startsAt": "2022-10-03T14:00:00",
              "endsAt": "2022-10-03T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "5019a8c2-7d5a-455f-bb92-a961426ceb5d",
                  "name": "Miles Bryant"
                },
                {
                  "id": "57870761-7278-4d97-9395-1f1a87ccc39d",
                  "name": "Suhail Patel"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120911,
                      "name": "Advanced"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          },
          {
            "id": 27478,
            "name": "Workshops Room",
            "session": {
              "id": "356678",
              "title": "Get to know Envoy - the modern proxy for cloud-native infrastructure",
              "description": "Envoy Proxy is a foundational layer for many of the innovations propelling the Kubernetes community, including service meshes and cloud-native API gateways. But many engineers understand it only as a black box, hidden by simplifying levels of abstraction. The purpose of this workshop is to provide a hands-on workshop that will bridge those gaps in Envoy's understanding. Participants will explore first principles regarding Envoy architecture, filter chains, and a day-in-the-life of a request.",
              "startsAt": "2022-10-03T14:00:00",
              "endsAt": "2022-10-03T15:30:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "3b0cdb4d-7f3b-458f-be81-5e916b4756e2",
                  "name": "Baptiste Collard"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 120908,
                      "name": "Tutorial / Workshop"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 27478,
              "room": "Workshops Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 2
          }
        ]
      },
      {
        "slotStart": "14:20:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "359381",
              "title": "Stick a fork in it, it’s done: how to halt your sidecar jobs",
              "description": "Inspired by some of the research done by the Linkerd team and by suggestions from the Linkerd community, Linkerd maintainer Matei David will present a few ways of ensuring that when deploying jobs,  sidecar containers terminate successfully when the main container finishes. \r\n\r\nSince the early days of Kubernetes, the sidecar container design pattern represents an easy and intuitive way to enhance the main container in a pod. The pattern has seen increased usage and adoption in production environments and serves a variety of platform-agnostic use cases such as collecting metrics and proxying traffic. Sidecar containers work well with most Kubernetes primitives, such as deployments, but they fall short when used in job objects. For service meshes or metric collectors, sidecars need to run continuously, blocking jobs from completing even after the main container has finished its work. \r\n",
              "startsAt": "2022-10-03T14:20:00",
              "endsAt": "2022-10-03T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "90531675-78bd-4c6d-af22-8c2bb0f4bb09",
                  "name": "Matei David"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121140,
                      "name": "Presentation (20m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "14:45:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "355107",
              "title": "Network Engineering Goes DevOoopsie",
              "description": "I sit here and reflect back to 2008 when my supervisor suggested I look into the CCNA and Network+. My world changed from plugging a cable into a switch to setting up BGP peers, to configuring Load Balancers for High Availability. Network Engineering has evolved and from my eyes, has been entirely reimagined, retaining the foundations of networking. \r\n\r\nAs I've slowly pivoted to the world of Cloud Native technologies and DevOps, a lot of my previous Network Engineering skills have translated to today's approach to microservices architecture. FOLLOW THE PACKETS I SAY!\r\n\r\nWhat does Networking mean for consumers of Kubernetes and Containers? What does K8S and containers mean Network Engineers? What does that transformation for a Network Engineer look like? \r\n\r\nIn this restrospective talk, I share my journey of Network Engineering from the late 2000s to one in 2022 surrounded by the world distributed systems, observability, the deeper need for security/identity and what our traffic tells us. \r\n\r\nMy hope is to inspire others to transform their network engineering career.",
              "startsAt": "2022-10-03T14:45:00",
              "endsAt": "2022-10-03T15:25:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "d7100338-7ea1-4f10-84fe-758b7ecbe1e7",
                  "name": "Marino Wijay"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "345842",
              "title": "How to protect your Kubernetes cluster using Crowdsec",
              "description": "The [CrowdSec](https://github.com/crowdsecurity/crowdsec/) project aims at providing a crowdsourced approach to common infrastructure defense problems, by distributing free & open-source software allowing you to protect yourself and share information about malevolent actors.\r\n\r\nCrowdSec could be perceived as a modern form of Fail2ban, though for Cloud and container-based infrastructure as well and capable of taking way more advanced decisions a lot faster. Mainly, it’s using a decoupled and distributed approach (detect here, remedy there) and an inference engine that leverages leaky buckets, YAML & Grok patterns to identify aggressive behaviors. It acquires signals from various data sources like files, syslogd, journald, AWS Cloudwatch and Kinesis, Docker logs and Windows Event Log, normalizes them, enriches them to apply heuristics and triggers a bouncer to deal with the threat, if need be. Since it’s written in Go, it’s compatible with almost any environment, fast in execution and ressource conservative.\r\n\r\nThe endgame is the Reputation engine though. If you want to partake in the network to benefit from its findings, CrowdSec captures all aggression signals (timestamp, IP, behavior) and sends them for curation. That way, it establishes a reliable IP blacklist that is constantly redistributed to the network members, in order to achieve a form of Digital Herd Immunity. An IP caught aggressing WordPress sites will quickly be banned by all members using CrowdSec that subscribed to the WordPress defense collection. In that way, we share the IPs that are relevant to your technical context.\r\n\r\nWhile Crowdsec is in charge of the detection, the reaction is performed by \"bouncers\" that aim to be deployable at any level of the applicative / infrastructure stack : \r\n\r\n* via nftables/iptables/pf based on an IP set\r\n* via Nginx lua plugin\r\n* via Traefik middleware\r\n* on Cloudflare via our bouncer that integrates with Cloudflare API\r\n* Or GCP/AWS/Azure firewall, slack or scripting, notifications, etc.\r\n\r\n.. or in many other ways. Over time the possibilities will increase as the application design basically supports anything. \r\n\r\nThis approach, combined with a declarative configuration and a stateless behavior, will make it an ideal candidate to enhance the security of modern stacks (containers, kubernetes, serverless and more generally automatically deployed infrastructures).\r\n\r\nFurthermore, we intend to create and share the most accurate database of malevolent actors as possible, under the form of a real-time IP reputation system, accessible through API. Whenever an attack is locally blocked/detected by Crowdsec, the \"meta\" information of the attack is shared amongst participants (source ip, date and triggered scenario) for redistribution to network members.\r\n\r\nWe are committed to building a strong community, with all that it implies :\r\n* [a public hub](https://hub.crowdsec.net) to find, share and amend parsers, scenarios and blockers\r\n* permissive open-source license to stay business friendly\r\n* and overall a strong commitment to transparency and community-first mentality, by tooling and behavior\r\n\r\nThe microservice architecture is the most significant security challenge in a Kubernetes cluster. Every application you deploy opens a new potential entry for attackers, increasing the attack surface.\r\nIn this talk, we'll present the Crowdsec project and see how we can protect a kubernetes cluster using Crowdsec and the power of the Crowd.\r\n",
              "startsAt": "2022-10-03T14:45:00",
              "endsAt": "2022-10-03T15:25:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "0cbcbc69-645a-44e6-b8ba-c81d3a0f4a59",
                  "name": "Hamza Essahely"
                },
                {
                  "id": "bbff0ea2-cc32-4655-9be8-2936a4a805ce",
                  "name": "Sebastien Blot"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "15:30:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "342887",
              "title": "Deploying a simple (Python) app to Kubernetes/OpenShift",
              "description": "JJ will walk you through deploying a simple python application to Kubernetes/OpenShift. We’ll start from the ground up, then get a complete automated build. The goal is to enable your developers to focus on code, not the infrastructure! It’s a chance to see the power of OpenShift and why taking the time to learn cloud-native development can get you the velocity you need.",
              "startsAt": "2022-10-03T15:30:00",
              "endsAt": "2022-10-03T16:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "1de5e334-6895-4c02-8b48-75ee6c1b46ca",
                  "name": "JJ Asghar"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "360162",
              "title": "Policy + Cloud Controllers = Secure Scalable Dev-Centric Infrastructure.",
              "description": "In large organizations, securing cloud infrastructure around Kubernetes is hard. Application developers, who’ve already had to learn Kubernetes, shouldn’t need to become IAC SMEs to operate their applications' backend cloud infrastructure. Alternatively, using infrastructure teams to service requests and centralize control doesn’t scale with an increasing number of users and use cases.\r\n\r\nIn this talk, Rowan and Henry will demonstrate how infrastructure teams can use policy engines to secure an emerging model that uses Kubernetes hosted cloud controllers (Crossplane, ACK, config-connector) to provision infrastructure. This model enables application teams to self serve, whilst preventing the launch of insecure infrastructure.\r\n\r\nTo ease adoption of the model, Rowan and Henry will open source policies and templates to enforce controls aligned with the CIS benchmarks and to simplify the developer experience by setting secure defaults and dynamically generating supporting cloud resources.",
              "startsAt": "2022-10-03T15:30:00",
              "endsAt": "2022-10-03T16:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "8ff09cbf-da9f-48bc-a236-4bec7d006b36",
                  "name": "Rowan Baker"
                },
                {
                  "id": "8ca8e2c4-b696-43eb-bce9-423c06472c07",
                  "name": "Henry Mortimer"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          },
          {
            "id": 27478,
            "name": "Workshops Room",
            "session": {
              "id": "358932",
              "title": "eBPF workshop",
              "description": "eBPF is a revolutionary technology with origins in the Linux kernel that can run sandboxed programs in an operating system kernel.\r\nIt is used to safely and efficiently extend the capabilities of the kernel without requiring to change kernel source code or load kernel modules.\r\nBumbleBee (https://github.com/solo-io/bumblebee) is a new Open Source project which helps to build, run and distribute eBPF programs using OCI images.\r\nIt allows you to focus on writing eBPF code, while taking care of the user space components - automatically exposing your data as metrics or logs.\r\nIn this workshop, we're introducing eBPF and the different ways to create eBPF programs.\r\nThen, attendees are creating their first eBPF program using BCC and libbpf to have a better understanding of the main concepts.\r\nFinally, they are going through several labs to build and deploy an eBPF program with BumbleBee. They also deploy Prometheus and a web application on Kubernetes to display all the communications happening in the  Kubernetes cluster.",
              "startsAt": "2022-10-03T15:30:00",
              "endsAt": "2022-10-03T17:35:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "8a229569-5156-4e17-a427-a180d065e79f",
                  "name": "Denis Jannot"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 120908,
                      "name": "Tutorial / Workshop"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 27478,
              "room": "Workshops Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 2
          }
        ]
      },
      {
        "slotStart": "16:10:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "e4fcaf33-14a9-493a-bbb2-ec0713d2bee7",
              "title": "Break",
              "description": null,
              "startsAt": "2022-10-03T16:10:00",
              "endsAt": "2022-10-03T16:30:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "16:30:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "352614",
              "title": "Secret Management: The Soft Way",
              "description": "Secrets. Security best-practices mandate that they stay away from the code—or else! And that’s what we did for a long time.\r\nBut as CI/CD practices evolved, for a myriad of reasons, we now want to ship the code, the environment, and the secrets, all in one lump. So, we can’t hide the secrets anymore… unless?\r\n\r\nTools like HashiCorp Vault attempt to address this by managing secrets outside the delivery chain. Great! But you can’t use those inside local dev environments, so… When that’s precisely what you need to do, then what?\r\n\r\nIn this talk, Lian will show the audience how to manage secrets the GitOps way, so you can maintain security best-practices while also being able to use them in your local environment for development. Sound like magic? That’s because it is.\r\n\r\nAfter this talk, the audience will be able to understand secret management solutions that work seamlessly in a variety of environments.",
              "startsAt": "2022-10-03T16:30:00",
              "endsAt": "2022-10-03T17:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "1559cccc-ed7c-4296-973d-3b05f3c3d25e",
                  "name": "Lian Li"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "390164",
              "title": "The Future of Continuous Delivery",
              "description": "It’s the year 2022, an exciting time for the tech industry. Globally, software organizations and internet companies are delivering more and more software, at a rate and scale that we’ve never faced before.\r\n\r\nThis unprecedented demand has created new challenges for us all, which have been hurting our organizations when creating continuous delivery solutions.\r\n\r\nThe great thing about these new challenges is that they’ve sparked new and amazing innovations in the CI/CD industry. In this Paul Dragoonis talks about the following:\r\n\r\nNew innovations in the CI/CD, Cloud Native, and open source communities are being developed.\r\n\r\nWhere these innovations are taking the world of continuous delivery.\r\n\r\nWhat to expect, from the CD community, later this year, and into the future",
              "startsAt": "2022-10-03T16:30:00",
              "endsAt": "2022-10-03T17:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "f10fddcf-5028-4f78-b861-13b2c44fef8e",
                  "name": "Paul Dragoonis"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "17:15:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "349810",
              "title": "Kubernetes cost monitoring best practices",
              "description": "There have been scenarios in which companies struggle to understand where they spend their cloud budget. For example, distinguishing between projects, teams, and applications with infrastructure services utilising them. Starting with why cost monitoring is essential, in this session, we'll learn about some of the best practices for monitoring your Kubernetes costs to maximise efficiency and reduce spending across teams, followed by some of the approaches we have seen organisations follow. Cost allocation can be complex in Kubernetes; hence, we'll also discuss what cost allocation models should be used. Such a set of best practices can reduce cloud spend and increase awareness within one's organisation.",
              "startsAt": "2022-10-03T17:15:00",
              "endsAt": "2022-10-03T17:35:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "8b4fad4b-e6a6-4574-adfa-5a0666393e9a",
                  "name": "Kunal Kushwaha"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121140,
                      "name": "Presentation (20m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "344082",
              "title": "Building Operators for Legacy Software or: Running Minecraft on Kubernetes",
              "description": "I've always loved Minecraft, and I've always loved playing it with my friends. Being the one with a home server, I setup my own Minecraft server. Soon I wanted to manage it with Kubernetes like the rest of my applications, and wanted to automate common tasks like backups and upgrades.\r\n\r\nSo I made an operator. This talk will cover the how of making an operator for a 'legacy' application that is not designed to be cloud-native, and why you might want to do it.\r\n\r\nThe operator is open source at https://github.com/jameslaverack/minecraft-operator. The operator and the talk are not endorsed by Mojang Studios or Microsoft in any way.",
              "startsAt": "2022-10-03T17:15:00",
              "endsAt": "2022-10-03T17:35:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "dc6b649b-15d2-4ede-a156-b1250ab5dd8c",
                  "name": "James Laverack"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121140,
                      "name": "Presentation (20m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120911,
                      "name": "Advanced"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "17:40:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "d29b6d98-b25c-408a-8fce-790bf90b152a",
              "title": "Closing",
              "description": null,
              "startsAt": "2022-10-03T17:40:00",
              "endsAt": "2022-10-03T18:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      }
    ]
  },
  {
    "date": "2022-10-04T00:00:00",
    "isDefault": false,
    "rooms": [
      {
        "id": 25859,
        "name": "Lloyds Banking Group Room",
        "sessions": [
          {
            "id": "32b2f447-6287-43cb-9d39-e894afcde54f",
            "title": "Coffee",
            "description": null,
            "startsAt": "2022-10-04T09:00:00",
            "endsAt": "2022-10-04T09:45:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "008cdb40-8083-4512-81f5-14b2b9f0da9d",
            "title": "Opening",
            "description": null,
            "startsAt": "2022-10-04T09:45:00",
            "endsAt": "2022-10-04T10:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "359748",
            "title": "tall oaks from little acorns grow - an Open Source journey",
            "description": "This session will detail the trials and tribulations of starting with a few lines of code to fix a problem, to ending up with a project that underpins millions of Kubernetes clusters. \r\n\r\nFrom angering end users by implementing what seemed at the time \"a good idea\" to being dragged in-front of a legal team, it isn’t all plain sailing. \r\n\r\nHowever through this talk the attendees will hopefully learn the joys of being part of Open Source, the elation of a community that comes to contribute and the realisation that it was worth it in the end!",
            "startsAt": "2022-10-04T10:00:00",
            "endsAt": "2022-10-04T10:40:00",
            "isServiceSession": false,
            "isPlenumSession": true,
            "speakers": [
              {
                "id": "ede643a2-ed47-4c2d-8a85-16a2e3bc1d73",
                "name": "Dan Finneran"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "390593",
            "title": "Fireside Chat: Open Source and the Global Security Response",
            "description": "Host: Amanda Brock, CEO, OpenUK\r\nAndrew Martin, Control Plane Founder and CEO and OpenUK CISO\r\nLiz Rice, Chief Open Source Officer, Isovalent and OpenUK Director\r\nThomas Meadows, Solutions Engineer, Jetstack",
            "startsAt": "2022-10-04T10:45:00",
            "endsAt": "2022-10-04T11:25:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "00aff0f5-9601-472b-8160-4514502e7e6a",
                "name": "Amanda Brock"
              },
              {
                "id": "30968699-c1ac-4eb9-8866-71cefe09a983",
                "name": "Andrew Martin"
              },
              {
                "id": "e48a182b-1cac-4e51-93b5-5e82408a6116",
                "name": "Liz Rice"
              },
              {
                "id": "3205a45b-0c6c-46ac-a3e1-3600f17f940d",
                "name": "Thomas Meadows"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "352663",
            "title": "ClickOps over GitOps",
            "description": "The delta between Kubernetes and a developer friendly PaaS is where the next layer of value is being created today. Many products are racing to fill the void that is called Kubernetes developer experience. This is also the place where things get opinionated, a requirement for reliable end to end workflows.\r\n\r\nIn this talk you will learn about Gimlet.io's approach on how Kubernetes UIs can be quick to use, and safe at the same time.\r\n\r\nIn this talk you will see how you can create a developer platform - with the usual components Cert-Manager, Nginx Ingress etc - and deploy on it with only clicking on a dashboard. You will also see that behind the curtains, all Gimlet does is writing yamls into a git repository. ClickOps.. over GitOps.",
            "startsAt": "2022-10-04T11:30:00",
            "endsAt": "2022-10-04T12:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "dd757d5f-ce93-41b2-9e1e-e4cf894b3edf",
                "name": "Laszlo Fogas"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "347140",
            "title": "K8s & meat: How we got Kubernetes into the Kaufland meat processing factories",
            "description": "Kubernetes, Kubernetes everywhere. Without any doubt, the adoption and usage of Kubernetes skyrocketed through the entire IT world. From tech-savvy startups, working on their next unicorn product, to conservative insurance companies increasing productivity and reducing time to market. It's hard to not see all the  benefits Kubernetes creates to IT organization. \r\n\r\nSo it was a matter of time, that our very own business gave us the task: Bring Kubernetes to our production facilities, and start with the Kaufland meat processing factories.\r\n\r\nIn this talk, I want to share our one-year-long journey to accomplish this mission. Sharing all the mistakes and the successes we made during this huge project. From learnings about all the security and compliance requirements when working in the industrial area to enabling the platform and application teams.  Of course, we will talk about all the technics we used like GitOps, Infrastructure as Code, Policy as Code and so on. \r\n\r\nIn short: k8s & meat, it's not always as tender as we thought it would.",
            "startsAt": "2022-10-04T12:15:00",
            "endsAt": "2022-10-04T12:55:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "693b0707-903e-4d37-817f-9547a7fc6e0b",
                "name": "Engin Diri"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "fee8d935-af12-4b2b-b4bb-59784892296e",
            "title": "Lunch",
            "description": null,
            "startsAt": "2022-10-04T13:00:00",
            "endsAt": "2022-10-04T14:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "390595",
            "title": "Introduction to OpenFeature",
            "description": "OpenFeature is an open standard for feature flag management, created to support a robust feature flag ecosystem using cloud native technologies. OpenFeature provides a unified API and SDK, and a developer-first, cloud-native implementation, with extensibility for open source and commercial offerings.\r\n\r\n",
            "startsAt": "2022-10-04T14:00:00",
            "endsAt": "2022-10-04T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "79e19ee7-0d57-46d0-81af-af5433fbf7a7",
                "name": "Alex Jones"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "342918",
            "title": "Crowdsourcing a Kubernetes distribution: What we learnt with MicroK8s",
            "description": "MicroK8s went from a part-time project to an Open-source success story available on every Ubuntu server in the world. \r\n\r\n\r\nHowever, behind its meteoric rise in usage, we struggled to balance the needs of end-users, the challenges of competition and \r\n\r\nIn this talk we’ll talk about how it took us time to realise the power of community, to build a way to enable them to help guide our roadmap and to truly recognise the power of crowdsourcing engineering through open source.\r\n",
            "startsAt": "2022-10-04T14:45:00",
            "endsAt": "2022-10-04T15:05:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "79e19ee7-0d57-46d0-81af-af5433fbf7a7",
                "name": "Alex Jones"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121140,
                    "name": "Presentation (20m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "359079",
            "title": "How to automate troubleshooting a k8s cluster environment",
            "description": "This session will introduce troubleshoot.sh, an open source project that helps diagnose common issues that could impact the successful deployment and operation of a Kubernetes cluster. We'll talk about how to use out-of-the-box tools, plus show you how to write your own custom collectors and analysers. Together these components should help identify issues before you install and once you are up and running.",
            "startsAt": "2022-10-04T15:05:00",
            "endsAt": "2022-10-04T15:25:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "e2d76afe-e65c-4c59-9ba6-c5e4d59bc7de",
                "name": "Alexander Trelore"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121140,
                    "name": "Presentation (20m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "352613",
            "title": "GitOps for the people",
            "description": "MoneyBank Inc. is a fintech enterprise that recently made the jump to K8s and GitOps to cope with the shift of demands from cranking out features towards stability and scalability. Yet, even with a fully automated CICD and shiny new microservices, features still take weeks to be released. As teams keep waiting on each other, frustrations, resentment, and mistrust grow.\r\n\r\nMoneyBank’s situation is typical for organizations with enterprise processes and startup mindsets. When faced with problems, the urge is often to move fast and automate them away. However, the cultural and regulatory structures to support these changes are not in the scope of said automation. One more piece is missing to address the needs of non-technical stakeholders within the ever-changing CICD landscape.\r\n\r\nIn this talk, we will attempt to automate the non-automatable with ReleaseOps: GitOps for the people.",
            "startsAt": "2022-10-04T15:30:00",
            "endsAt": "2022-10-04T16:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "1559cccc-ed7c-4296-973d-3b05f3c3d25e",
                "name": "Lian Li"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "786eebaf-e916-4764-a8e1-b8d64bd85247",
            "title": "Break",
            "description": null,
            "startsAt": "2022-10-04T16:10:00",
            "endsAt": "2022-10-04T16:30:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "343391",
            "title": "What DragonBall can teach us about being engineers",
            "description": "The world of DragonBall has many teachings that we can apply to our life as developers, SREs and DevOps engineers. In this fun and fast-paced talk we'll learn how the Z Warriors were ahead of their time and how they fully embrace the engineer mindset. ",
            "startsAt": "2022-10-04T16:30:00",
            "endsAt": "2022-10-04T16:40:00",
            "isServiceSession": false,
            "isPlenumSession": true,
            "speakers": [
              {
                "id": "b44f65fd-6449-47e4-a00f-2b308ec3e8bf",
                "name": "Marcus Noble"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121141,
                    "name": "Lightning Talk / Ignite"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "349812",
            "title": "Scaling Communities to be more Inclusive",
            "description": "Being an open-source enthusiast, Kunal believes that diversity in the workplace and participation from people hailing from different cultures is necessary as well as instrumental for the growth of the IT sector. It exposes one to the multitude of values and principles that people from varying ethnicities hold. Meeting people from around the world teaches people to respect opposing perspectives and opinions, and ingrains in them respect for their peers.\r\n\r\nHe finds passion in teaching and has taught thousands of students both online and in-person. He is the founder of Community Classroom, an organisation focussed on providing training & mentorship, free of cost. He also started the Official Cloud Native Student Community group joined by thousands of students, focussed on getting more young people involved in the Cloud Native world. These platforms are utilised by conducting hands-on workshops, events, podcasts, and sharing about opportunities in the field.\r\n\r\nThe talk is going to be focussed around what defines a community, and figuring out what are the community's shared struggles. It’s also important to know what is the mission of your community and what members look to get out of it. Communication is key and we’ll also talk about how to future proof your community. Regarding diversity and inclusion, it’s important to know who might be excluded from accessing your community activities in their current form. We’ll also discuss about what are some of the negative scenarios which might happen while running activities for your community which will make them less inclusive to marginalised groups. Following up with designing for your community's needs, and last but not least, having a Code of Conduct.\r\n\r\nAttendees will learn about: \r\nHow to start a new community and make it inclusive from the beginning.\r\nHow to scale communities to under-representative groups\r\nHow to deal with conflicts and take care of your audience’s needs.",
            "startsAt": "2022-10-04T16:45:00",
            "endsAt": "2022-10-04T16:55:00",
            "isServiceSession": false,
            "isPlenumSession": true,
            "speakers": [
              {
                "id": "8b4fad4b-e6a6-4574-adfa-5a0666393e9a",
                "name": "Kunal Kushwaha"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121141,
                    "name": "Lightning Talk / Ignite"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "364441",
            "title": "State of Open - what is open source and why it matters in Scotland today",
            "description": "A strategic scene setting of open source and how it got to its premier status in the software market today, an update from OpenUK's State of Open : The UK in 2022 report, and a strategic view on curation, stewardship and the future of open source in the enterprise and public sector as it becomes our critical national infrastructure. ",
            "startsAt": "2022-10-04T17:00:00",
            "endsAt": "2022-10-04T17:40:00",
            "isServiceSession": false,
            "isPlenumSession": true,
            "speakers": [
              {
                "id": "00aff0f5-9601-472b-8160-4514502e7e6a",
                "name": "Amanda Brock"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120909,
                    "name": "Introductory and overview"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "b148ea49-0d26-4250-8654-812e18d321e1",
            "title": "Closing",
            "description": null,
            "startsAt": "2022-10-04T17:40:00",
            "endsAt": "2022-10-04T18:00:00",
            "isServiceSession": true,
            "isPlenumSession": true,
            "speakers": [],
            "categories": [],
            "roomId": 25859,
            "room": "Lloyds Banking Group Room",
            "liveUrl": null,
            "recordingUrl": null
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 25860,
        "name": "ControlPlane Room",
        "sessions": [
          {
            "id": "346571",
            "title": "EBPF and Kubernetes - Next level observability",
            "description": "A deep dive into how EBPF pairs with kubernetes to provide real time, low overhead tracing. This will focus on what ebpf is, how it fits into the kubernetes ecosystem and how tools like pixie can take tie it all together",
            "startsAt": "2022-10-04T10:45:00",
            "endsAt": "2022-10-04T11:25:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "61a725a9-cdf5-4935-91c7-e0a88eeb9ae1",
                "name": "Owen Bowers Adams"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120911,
                    "name": "Advanced"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "359831",
            "title": "BumbleBee: Or How I Learned To Stop Worrying And Love eBPF",
            "description": "eBPF is hard. There are more and more docs and blogs, but the learning curve seems to be really steep. Where could you possibly start to play around with this new technology? \r\nIn this talk, I will briefly introduce the (e)BPF landscape, then show you one of the easiest way to get started with eBPF. We will explore existing tools, and see what it takes to drop them into a Kubernetes cluster, and learn how can you expose their output as Prometheus metrics with only a few keystrokes.",
            "startsAt": "2022-10-04T11:30:00",
            "endsAt": "2022-10-04T12:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "97c43b1b-2ca7-48de-b328-ff93409d99b4",
                "name": "Krisztian Fekete"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "344433",
            "title": "Why We Chose To Ditch Helm To Gain Open Source Sanity",
            "description": "Helm is a truly excellent ecosystem and is rightly valued by the world over for giving full customisation of deployments. For open-source projects with a finite number of support engineers, full customisation is not always something that is desirable. Sometimes, you need to provide opinionated guide rails for people in order to provide effective support for your product.\r\n\r\nThis session will focus on the reasons why Gitpod has deprecated its Helm charts and switched to a custom-built Installer. Simon will explore some of the benefits and pitfalls experienced and how the community reacted to such a seismic change. He will also answer the question - \"would he do it again?\"",
            "startsAt": "2022-10-04T12:15:00",
            "endsAt": "2022-10-04T12:55:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "f57c52cf-a775-446a-84b2-1be2343d3ac5",
                "name": "Simon Emms"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120911,
                    "name": "Advanced"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "348135",
            "title": "The Wonders and Woes of Webhooks",
            "description": "Since introduced in Kubernetes v1.9, webhooks have been a key feature, making up one of the cornerstones of Kubernetes extensibility. When used right, they can allow operators to have much more control over their clusters and with tooling like Kyverno and Gatekeeper it’s easier than ever to leverage their full power. But, when misused, things can get very, very messy.\r\n\r\nSo how do we ensure our webhooks are full of wonders and not woes?\r\n\r\nBy taking a look at the history of webhooks in Kubernetes, the driving force behind their adoption and through several horror stories of webhooks gone wrong, we can develop a set of best practices and guidelines to follow to ensure our webhooks stay full of wonder without the woes.",
            "startsAt": "2022-10-04T14:00:00",
            "endsAt": "2022-10-04T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "b44f65fd-6449-47e4-a00f-2b308ec3e8bf",
                "name": "Marcus Noble"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "375231",
            "title": "Using Kubernetes and A Service Mesh to Build a Resilient Platform",
            "description": "This session will discuss how Skyscanner's Production Platform tribe designed a new, resilient architecture to allow Skyscanner's engineers to deliver new features to travelers on a reliable multi-tenant platform.\r\n\r\nWe'll discuss what inspired the design choices, where trade-offs had to be made, the challenges faced, and the successes along the way. This will include how this architecture enabled Skyscanner to perform multiple cluster upgrades and migrations without service owners even noticing, as well as more day-to-day cluster tasks like component upgrades in a safe and scalable manner.",
            "startsAt": "2022-10-04T14:45:00",
            "endsAt": "2022-10-04T15:25:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "12fbb300-3cdf-41b2-9372-cff28721b607",
                "name": "Guy Templeton"
              },
              {
                "id": "ab148857-33e8-41d3-8e22-d28dd309069f",
                "name": "Alex Williams"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120911,
                    "name": "Advanced"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          },
          {
            "id": "379915",
            "title": "Gateway APIs and API Gateways - modern ingress demystified",
            "description": "Up until now, Ingress routes into K8s clusters have been defined by the Ingress kind, or by vendor-specific CRDs. Neither of these were satisfactory, so a new set of built-in k8s APIs was developed - the Gateway API.\r\n\r\nIn this talk, Matt will cover the motivation for a new API, its design, and show some examples of its use. He'll then also cover implimentations of it today and in the future, and talk about the exciting merging of several of the existing ingress controllers into one new de facto standard - Envoy Gateway.",
            "startsAt": "2022-10-04T15:30:00",
            "endsAt": "2022-10-04T16:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "c8b0a46e-394c-4ec9-998f-12d750bb0d6c",
                "name": "Matt Turner"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 121139,
                    "name": "Presentation (40m)"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120910,
                    "name": "Intermediate"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 25860,
            "room": "ControlPlane Room",
            "liveUrl": null,
            "recordingUrl": null
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 27479,
        "name": "Sponsor Showcase",
        "sessions": [
          {
            "id": "359966",
            "title": "Capture the Flag - Kubernetes Edition",
            "description": "Delve deeper into the dark and mysterious world of Kubernetes security!  Exploit a supply chain attack and start your journey deep inside the target infrastructure, exploit your position to hunt and collect the flags, and hopefully learn something new and wryly amusing along the way!\r\n\r\nAttendees can play six increasingly beguiling and demanding scenarios to bushwhack their way through the dense jungle of Kubernetes security. Everybody is welcome, from beginner to hardened veteran, as we venture amongst the low-hanging fruits of insecure configuration and scale the lofty peaks of cluster compromise!\r\n\r\n\r\n\r\nTo attend this workshop, you will need a laptop (or tablet if so inclined) as well as a basic understanding of how to interact with Linux from a terminal (e.g. ls, cd, cat, grep).  You will be given access to a cluster and it's up to you if you'd like to run this alone or as part of a team.",
            "startsAt": "2022-10-04T10:40:00",
            "endsAt": "2022-10-04T16:10:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "30968699-c1ac-4eb9-8866-71cefe09a983",
                "name": "Andrew Martin"
              }
            ],
            "categories": [
              {
                "id": 38933,
                "name": "Session format",
                "categoryItems": [
                  {
                    "id": 120908,
                    "name": "Tutorial / Workshop"
                  }
                ],
                "sort": 0
              },
              {
                "id": 38934,
                "name": "Level",
                "categoryItems": [
                  {
                    "id": 120911,
                    "name": "Advanced"
                  }
                ],
                "sort": 2
              }
            ],
            "roomId": 27479,
            "room": "Sponsor Showcase",
            "liveUrl": null,
            "recordingUrl": null
          }
        ],
        "hasOnlyPlenumSessions": false
      }
    ],
    "timeSlots": [
      {
        "slotStart": "09:00:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "32b2f447-6287-43cb-9d39-e894afcde54f",
              "title": "Coffee",
              "description": null,
              "startsAt": "2022-10-04T09:00:00",
              "endsAt": "2022-10-04T09:45:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "09:45:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "008cdb40-8083-4512-81f5-14b2b9f0da9d",
              "title": "Opening",
              "description": null,
              "startsAt": "2022-10-04T09:45:00",
              "endsAt": "2022-10-04T10:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "10:00:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "359748",
              "title": "tall oaks from little acorns grow - an Open Source journey",
              "description": "This session will detail the trials and tribulations of starting with a few lines of code to fix a problem, to ending up with a project that underpins millions of Kubernetes clusters. \r\n\r\nFrom angering end users by implementing what seemed at the time \"a good idea\" to being dragged in-front of a legal team, it isn’t all plain sailing. \r\n\r\nHowever through this talk the attendees will hopefully learn the joys of being part of Open Source, the elation of a community that comes to contribute and the realisation that it was worth it in the end!",
              "startsAt": "2022-10-04T10:00:00",
              "endsAt": "2022-10-04T10:40:00",
              "isServiceSession": false,
              "isPlenumSession": true,
              "speakers": [
                {
                  "id": "ede643a2-ed47-4c2d-8a85-16a2e3bc1d73",
                  "name": "Dan Finneran"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "10:40:00",
        "rooms": [
          {
            "id": 27479,
            "name": "Sponsor Showcase",
            "session": {
              "id": "359966",
              "title": "Capture the Flag - Kubernetes Edition",
              "description": "Delve deeper into the dark and mysterious world of Kubernetes security!  Exploit a supply chain attack and start your journey deep inside the target infrastructure, exploit your position to hunt and collect the flags, and hopefully learn something new and wryly amusing along the way!\r\n\r\nAttendees can play six increasingly beguiling and demanding scenarios to bushwhack their way through the dense jungle of Kubernetes security. Everybody is welcome, from beginner to hardened veteran, as we venture amongst the low-hanging fruits of insecure configuration and scale the lofty peaks of cluster compromise!\r\n\r\n\r\n\r\nTo attend this workshop, you will need a laptop (or tablet if so inclined) as well as a basic understanding of how to interact with Linux from a terminal (e.g. ls, cd, cat, grep).  You will be given access to a cluster and it's up to you if you'd like to run this alone or as part of a team.",
              "startsAt": "2022-10-04T10:40:00",
              "endsAt": "2022-10-04T16:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "30968699-c1ac-4eb9-8866-71cefe09a983",
                  "name": "Andrew Martin"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 120908,
                      "name": "Tutorial / Workshop"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120911,
                      "name": "Advanced"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 27479,
              "room": "Sponsor Showcase",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 2
          }
        ]
      },
      {
        "slotStart": "10:45:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "390593",
              "title": "Fireside Chat: Open Source and the Global Security Response",
              "description": "Host: Amanda Brock, CEO, OpenUK\r\nAndrew Martin, Control Plane Founder and CEO and OpenUK CISO\r\nLiz Rice, Chief Open Source Officer, Isovalent and OpenUK Director\r\nThomas Meadows, Solutions Engineer, Jetstack",
              "startsAt": "2022-10-04T10:45:00",
              "endsAt": "2022-10-04T11:25:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "00aff0f5-9601-472b-8160-4514502e7e6a",
                  "name": "Amanda Brock"
                },
                {
                  "id": "30968699-c1ac-4eb9-8866-71cefe09a983",
                  "name": "Andrew Martin"
                },
                {
                  "id": "e48a182b-1cac-4e51-93b5-5e82408a6116",
                  "name": "Liz Rice"
                },
                {
                  "id": "3205a45b-0c6c-46ac-a3e1-3600f17f940d",
                  "name": "Thomas Meadows"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "346571",
              "title": "EBPF and Kubernetes - Next level observability",
              "description": "A deep dive into how EBPF pairs with kubernetes to provide real time, low overhead tracing. This will focus on what ebpf is, how it fits into the kubernetes ecosystem and how tools like pixie can take tie it all together",
              "startsAt": "2022-10-04T10:45:00",
              "endsAt": "2022-10-04T11:25:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "61a725a9-cdf5-4935-91c7-e0a88eeb9ae1",
                  "name": "Owen Bowers Adams"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120911,
                      "name": "Advanced"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "11:30:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "352663",
              "title": "ClickOps over GitOps",
              "description": "The delta between Kubernetes and a developer friendly PaaS is where the next layer of value is being created today. Many products are racing to fill the void that is called Kubernetes developer experience. This is also the place where things get opinionated, a requirement for reliable end to end workflows.\r\n\r\nIn this talk you will learn about Gimlet.io's approach on how Kubernetes UIs can be quick to use, and safe at the same time.\r\n\r\nIn this talk you will see how you can create a developer platform - with the usual components Cert-Manager, Nginx Ingress etc - and deploy on it with only clicking on a dashboard. You will also see that behind the curtains, all Gimlet does is writing yamls into a git repository. ClickOps.. over GitOps.",
              "startsAt": "2022-10-04T11:30:00",
              "endsAt": "2022-10-04T12:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "dd757d5f-ce93-41b2-9e1e-e4cf894b3edf",
                  "name": "Laszlo Fogas"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "359831",
              "title": "BumbleBee: Or How I Learned To Stop Worrying And Love eBPF",
              "description": "eBPF is hard. There are more and more docs and blogs, but the learning curve seems to be really steep. Where could you possibly start to play around with this new technology? \r\nIn this talk, I will briefly introduce the (e)BPF landscape, then show you one of the easiest way to get started with eBPF. We will explore existing tools, and see what it takes to drop them into a Kubernetes cluster, and learn how can you expose their output as Prometheus metrics with only a few keystrokes.",
              "startsAt": "2022-10-04T11:30:00",
              "endsAt": "2022-10-04T12:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "97c43b1b-2ca7-48de-b328-ff93409d99b4",
                  "name": "Krisztian Fekete"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "12:15:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "347140",
              "title": "K8s & meat: How we got Kubernetes into the Kaufland meat processing factories",
              "description": "Kubernetes, Kubernetes everywhere. Without any doubt, the adoption and usage of Kubernetes skyrocketed through the entire IT world. From tech-savvy startups, working on their next unicorn product, to conservative insurance companies increasing productivity and reducing time to market. It's hard to not see all the  benefits Kubernetes creates to IT organization. \r\n\r\nSo it was a matter of time, that our very own business gave us the task: Bring Kubernetes to our production facilities, and start with the Kaufland meat processing factories.\r\n\r\nIn this talk, I want to share our one-year-long journey to accomplish this mission. Sharing all the mistakes and the successes we made during this huge project. From learnings about all the security and compliance requirements when working in the industrial area to enabling the platform and application teams.  Of course, we will talk about all the technics we used like GitOps, Infrastructure as Code, Policy as Code and so on. \r\n\r\nIn short: k8s & meat, it's not always as tender as we thought it would.",
              "startsAt": "2022-10-04T12:15:00",
              "endsAt": "2022-10-04T12:55:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "693b0707-903e-4d37-817f-9547a7fc6e0b",
                  "name": "Engin Diri"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "344433",
              "title": "Why We Chose To Ditch Helm To Gain Open Source Sanity",
              "description": "Helm is a truly excellent ecosystem and is rightly valued by the world over for giving full customisation of deployments. For open-source projects with a finite number of support engineers, full customisation is not always something that is desirable. Sometimes, you need to provide opinionated guide rails for people in order to provide effective support for your product.\r\n\r\nThis session will focus on the reasons why Gitpod has deprecated its Helm charts and switched to a custom-built Installer. Simon will explore some of the benefits and pitfalls experienced and how the community reacted to such a seismic change. He will also answer the question - \"would he do it again?\"",
              "startsAt": "2022-10-04T12:15:00",
              "endsAt": "2022-10-04T12:55:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "f57c52cf-a775-446a-84b2-1be2343d3ac5",
                  "name": "Simon Emms"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120911,
                      "name": "Advanced"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "13:00:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "fee8d935-af12-4b2b-b4bb-59784892296e",
              "title": "Lunch",
              "description": null,
              "startsAt": "2022-10-04T13:00:00",
              "endsAt": "2022-10-04T14:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "14:00:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "390595",
              "title": "Introduction to OpenFeature",
              "description": "OpenFeature is an open standard for feature flag management, created to support a robust feature flag ecosystem using cloud native technologies. OpenFeature provides a unified API and SDK, and a developer-first, cloud-native implementation, with extensibility for open source and commercial offerings.\r\n\r\n",
              "startsAt": "2022-10-04T14:00:00",
              "endsAt": "2022-10-04T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "79e19ee7-0d57-46d0-81af-af5433fbf7a7",
                  "name": "Alex Jones"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "348135",
              "title": "The Wonders and Woes of Webhooks",
              "description": "Since introduced in Kubernetes v1.9, webhooks have been a key feature, making up one of the cornerstones of Kubernetes extensibility. When used right, they can allow operators to have much more control over their clusters and with tooling like Kyverno and Gatekeeper it’s easier than ever to leverage their full power. But, when misused, things can get very, very messy.\r\n\r\nSo how do we ensure our webhooks are full of wonders and not woes?\r\n\r\nBy taking a look at the history of webhooks in Kubernetes, the driving force behind their adoption and through several horror stories of webhooks gone wrong, we can develop a set of best practices and guidelines to follow to ensure our webhooks stay full of wonder without the woes.",
              "startsAt": "2022-10-04T14:00:00",
              "endsAt": "2022-10-04T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "b44f65fd-6449-47e4-a00f-2b308ec3e8bf",
                  "name": "Marcus Noble"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "14:45:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "342918",
              "title": "Crowdsourcing a Kubernetes distribution: What we learnt with MicroK8s",
              "description": "MicroK8s went from a part-time project to an Open-source success story available on every Ubuntu server in the world. \r\n\r\n\r\nHowever, behind its meteoric rise in usage, we struggled to balance the needs of end-users, the challenges of competition and \r\n\r\nIn this talk we’ll talk about how it took us time to realise the power of community, to build a way to enable them to help guide our roadmap and to truly recognise the power of crowdsourcing engineering through open source.\r\n",
              "startsAt": "2022-10-04T14:45:00",
              "endsAt": "2022-10-04T15:05:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "79e19ee7-0d57-46d0-81af-af5433fbf7a7",
                  "name": "Alex Jones"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121140,
                      "name": "Presentation (20m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "375231",
              "title": "Using Kubernetes and A Service Mesh to Build a Resilient Platform",
              "description": "This session will discuss how Skyscanner's Production Platform tribe designed a new, resilient architecture to allow Skyscanner's engineers to deliver new features to travelers on a reliable multi-tenant platform.\r\n\r\nWe'll discuss what inspired the design choices, where trade-offs had to be made, the challenges faced, and the successes along the way. This will include how this architecture enabled Skyscanner to perform multiple cluster upgrades and migrations without service owners even noticing, as well as more day-to-day cluster tasks like component upgrades in a safe and scalable manner.",
              "startsAt": "2022-10-04T14:45:00",
              "endsAt": "2022-10-04T15:25:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "12fbb300-3cdf-41b2-9372-cff28721b607",
                  "name": "Guy Templeton"
                },
                {
                  "id": "ab148857-33e8-41d3-8e22-d28dd309069f",
                  "name": "Alex Williams"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120911,
                      "name": "Advanced"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "15:05:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "359079",
              "title": "How to automate troubleshooting a k8s cluster environment",
              "description": "This session will introduce troubleshoot.sh, an open source project that helps diagnose common issues that could impact the successful deployment and operation of a Kubernetes cluster. We'll talk about how to use out-of-the-box tools, plus show you how to write your own custom collectors and analysers. Together these components should help identify issues before you install and once you are up and running.",
              "startsAt": "2022-10-04T15:05:00",
              "endsAt": "2022-10-04T15:25:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "e2d76afe-e65c-4c59-9ba6-c5e4d59bc7de",
                  "name": "Alexander Trelore"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121140,
                      "name": "Presentation (20m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "15:30:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "352613",
              "title": "GitOps for the people",
              "description": "MoneyBank Inc. is a fintech enterprise that recently made the jump to K8s and GitOps to cope with the shift of demands from cranking out features towards stability and scalability. Yet, even with a fully automated CICD and shiny new microservices, features still take weeks to be released. As teams keep waiting on each other, frustrations, resentment, and mistrust grow.\r\n\r\nMoneyBank’s situation is typical for organizations with enterprise processes and startup mindsets. When faced with problems, the urge is often to move fast and automate them away. However, the cultural and regulatory structures to support these changes are not in the scope of said automation. One more piece is missing to address the needs of non-technical stakeholders within the ever-changing CICD landscape.\r\n\r\nIn this talk, we will attempt to automate the non-automatable with ReleaseOps: GitOps for the people.",
              "startsAt": "2022-10-04T15:30:00",
              "endsAt": "2022-10-04T16:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "1559cccc-ed7c-4296-973d-3b05f3c3d25e",
                  "name": "Lian Li"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          },
          {
            "id": 25860,
            "name": "ControlPlane Room",
            "session": {
              "id": "379915",
              "title": "Gateway APIs and API Gateways - modern ingress demystified",
              "description": "Up until now, Ingress routes into K8s clusters have been defined by the Ingress kind, or by vendor-specific CRDs. Neither of these were satisfactory, so a new set of built-in k8s APIs was developed - the Gateway API.\r\n\r\nIn this talk, Matt will cover the motivation for a new API, its design, and show some examples of its use. He'll then also cover implimentations of it today and in the future, and talk about the exciting merging of several of the existing ingress controllers into one new de facto standard - Envoy Gateway.",
              "startsAt": "2022-10-04T15:30:00",
              "endsAt": "2022-10-04T16:10:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "c8b0a46e-394c-4ec9-998f-12d750bb0d6c",
                  "name": "Matt Turner"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120910,
                      "name": "Intermediate"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25860,
              "room": "ControlPlane Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 1
          }
        ]
      },
      {
        "slotStart": "16:10:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "786eebaf-e916-4764-a8e1-b8d64bd85247",
              "title": "Break",
              "description": null,
              "startsAt": "2022-10-04T16:10:00",
              "endsAt": "2022-10-04T16:30:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "16:30:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "343391",
              "title": "What DragonBall can teach us about being engineers",
              "description": "The world of DragonBall has many teachings that we can apply to our life as developers, SREs and DevOps engineers. In this fun and fast-paced talk we'll learn how the Z Warriors were ahead of their time and how they fully embrace the engineer mindset. ",
              "startsAt": "2022-10-04T16:30:00",
              "endsAt": "2022-10-04T16:40:00",
              "isServiceSession": false,
              "isPlenumSession": true,
              "speakers": [
                {
                  "id": "b44f65fd-6449-47e4-a00f-2b308ec3e8bf",
                  "name": "Marcus Noble"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121141,
                      "name": "Lightning Talk / Ignite"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "16:45:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "349812",
              "title": "Scaling Communities to be more Inclusive",
              "description": "Being an open-source enthusiast, Kunal believes that diversity in the workplace and participation from people hailing from different cultures is necessary as well as instrumental for the growth of the IT sector. It exposes one to the multitude of values and principles that people from varying ethnicities hold. Meeting people from around the world teaches people to respect opposing perspectives and opinions, and ingrains in them respect for their peers.\r\n\r\nHe finds passion in teaching and has taught thousands of students both online and in-person. He is the founder of Community Classroom, an organisation focussed on providing training & mentorship, free of cost. He also started the Official Cloud Native Student Community group joined by thousands of students, focussed on getting more young people involved in the Cloud Native world. These platforms are utilised by conducting hands-on workshops, events, podcasts, and sharing about opportunities in the field.\r\n\r\nThe talk is going to be focussed around what defines a community, and figuring out what are the community's shared struggles. It’s also important to know what is the mission of your community and what members look to get out of it. Communication is key and we’ll also talk about how to future proof your community. Regarding diversity and inclusion, it’s important to know who might be excluded from accessing your community activities in their current form. We’ll also discuss about what are some of the negative scenarios which might happen while running activities for your community which will make them less inclusive to marginalised groups. Following up with designing for your community's needs, and last but not least, having a Code of Conduct.\r\n\r\nAttendees will learn about: \r\nHow to start a new community and make it inclusive from the beginning.\r\nHow to scale communities to under-representative groups\r\nHow to deal with conflicts and take care of your audience’s needs.",
              "startsAt": "2022-10-04T16:45:00",
              "endsAt": "2022-10-04T16:55:00",
              "isServiceSession": false,
              "isPlenumSession": true,
              "speakers": [
                {
                  "id": "8b4fad4b-e6a6-4574-adfa-5a0666393e9a",
                  "name": "Kunal Kushwaha"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121141,
                      "name": "Lightning Talk / Ignite"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "17:00:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "364441",
              "title": "State of Open - what is open source and why it matters in Scotland today",
              "description": "A strategic scene setting of open source and how it got to its premier status in the software market today, an update from OpenUK's State of Open : The UK in 2022 report, and a strategic view on curation, stewardship and the future of open source in the enterprise and public sector as it becomes our critical national infrastructure. ",
              "startsAt": "2022-10-04T17:00:00",
              "endsAt": "2022-10-04T17:40:00",
              "isServiceSession": false,
              "isPlenumSession": true,
              "speakers": [
                {
                  "id": "00aff0f5-9601-472b-8160-4514502e7e6a",
                  "name": "Amanda Brock"
                }
              ],
              "categories": [
                {
                  "id": 38933,
                  "name": "Session format",
                  "categoryItems": [
                    {
                      "id": 121139,
                      "name": "Presentation (40m)"
                    }
                  ],
                  "sort": 0
                },
                {
                  "id": 38934,
                  "name": "Level",
                  "categoryItems": [
                    {
                      "id": 120909,
                      "name": "Introductory and overview"
                    }
                  ],
                  "sort": 2
                }
              ],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "17:40:00",
        "rooms": [
          {
            "id": 25859,
            "name": "Lloyds Banking Group Room",
            "session": {
              "id": "b148ea49-0d26-4250-8654-812e18d321e1",
              "title": "Closing",
              "description": null,
              "startsAt": "2022-10-04T17:40:00",
              "endsAt": "2022-10-04T18:00:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 25859,
              "room": "Lloyds Banking Group Room",
              "liveUrl": null,
              "recordingUrl": null
            },
            "index": 0
          }
        ]
      }
    ]
  }
]